{"backend": "tensorflow", "config": [{"config": {"trainable": true, "activation": "linear", "use_bias": true, "filters": 16, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "name": "block0_conv0", "batch_input_shape": [null, 40, 40, 3], "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 32, "data_format": "channels_last", "name": "block1_conv1", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block1_pool", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 64, "data_format": "channels_last", "name": "block2_conv1", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block2_pool", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 128, "data_format": "channels_last", "name": "block3_conv1", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [4, 4], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "name": "block3_pool", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"rate": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "filters": 128, "data_format": "channels_last", "name": "block4_conv1", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "fc_flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "name": "fc_output", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "units": 51, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.1", "class_name": "Sequential"}